Revit 2026 API

# FamilySymbolGetThermalProperties Method

---

Gets the thermal properties for the given FamilySymbol.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public FamilyThermalProperties GetThermalProperties()
```
```vb
Public Function GetThermalProperties As FamilyThermalProperties
```
```cpp
public:
FamilyThermalProperties^ GetThermalProperties()
```
```fsharp
member GetThermalProperties : unit -> FamilyThermalProperties
```

#### Return Value

FamilyThermalProperties The thermal properties.  if the family symbol does not contain thermal properties.

Doors, windows, and curtain wall panels will have thermal properties.

#### Reference

FamilySymbol Class

Autodesk.Revit.DB Namespace